{
	"general-blurb": "Jacob Stenzel has always been a fan of making things, whether that thing be something meaningful like a composition for symphonic band, something bizarre like a stop-action film with some things he found in his room, or a Doctor Who themed marble rollercoaster for a physics project.\nBefore he was ever a programmer, Jacob Stenzel was a musician, a composer to be specific. He treats composition like an archival tool, or a way to record an atmosphere or feeling that words can't accurately recreate. His studies began under Jenny Ryan at Monacan High School, where he composed and premiered the piece \"Come the Winter's End\" for concert band. After having been accepted into Virginia Tech, Jacob continues to study music under Charles Nichols and Ico Bukvic. Here, he has had such works performed as 'The Insomniac' for laptop orchestra and 'A Fragile State' for soprano saxophone and piano. He also serves as Vice President of MusiComp, where he seeks to serve the music composition community at Virginia Tech by seeking out and providing new opportunities for composers and by fostering collaboration between composers\nThough music remains his passion, Jacob's major at Virginia Tech is something completely different, but arguably very similar. Jacob currently studies computer science, where he continues to make exciting things, only this time in the form of powerful, intuitive, and flexible software. Jacob exercises this passion for exciting software through his role as an 'Instrument Builder' for the Linux Laptop Orchestra at Virginia Tech, where he programs expressive instruments for gesture control devices such as the Wii Remote. Jacob has also gotten the opportunity to serve as a software development intern with Fidelity Investments, where he was an active member of the maintenance and small enhancements team for its Plan Sponsor WebStation.",

	"programmer-blurb": "Jacob Stenzel has always been a fan of making things, whether that thing be something meaningful like a composition for symphonic band, something bizarre like a stop-action film with some things he found in his room, or a Doctor Who themed marble rollercoaster for a physics project. With a mindset like that, what better a way to make things than by programming exciting software?\nJacob Stenzel began his journey into programming sometime around 2011 in a strange turn of events that even he hardly understands. After learning enough Java to scrape through an introductory computer science course at Monacan High School, he decided that Virginia Tech was the college for him and computer science his study of choice.\nAt Virginia Tech, Jacob found a passion for technology that makes people say \"Wow\" and enables them to do and to make exciting things of their own. As an instrument builder for the Laptop Orchestra, Jacob has gotten the unique opportunity to program intuitive, engaging, and flexible musical instruments through the use of gesture control devices like the Wii Remote. During his internship Fidelity, Jacob was given a chance to collaborate with systems analysts and developers to create an enhancement to the Plan Sponsor WebStation application to accommodate the submission of Qualified Medical Child Support Orders, a document with no standardized means of handling at the time.",

	"composer-blurb": "Jacob Stenzel currently studies music composition at Virginia Tech alongside his Computer Science degree and his hobbies as a trumpeter, performer, and instrument builder in the L2Ork Laptop Orchestra. He first independently studied music theory and composition at Monacan High School with Jenny Ryan. He has composed pieces such as The Insomniac for laptop orchestra, Racing the Clock for orchestra, A Fragile State for soprano sax and piano, Termite for woodwind trio, Youthful Dynamism for strings, Variations on a Lucid Dream for concert band, Future Comes Now for solo violin, and Come the Winter’s End for concert band, premiered by the Monacan High School Symphonic Band during their Spring 2013 concert. During his time at Monacan High School, Jacob was also involved in the Jazz Band,Marching Band, and Symphonic Band. After graduating from high school, Jacob Stenzel was accepted into Virginia Tech’s College of Engineering, and subsequently into the discipline of Computer Science. He has remained active in the field of music composition by studying composition under Charles Nichols and serving as instrument builder and composer for the L2Ork Laptop Orchestra under Ico Bukvic. \nCurrently he serves as Vice President of MusiComp, where he seeks to serve the music composition community at Virginia Tech by seeking out and providing new opportunities for composers and by fostering collaboration between composers",

	"blog-introduction": "Welcome to my blog! This is where I catalogue my experiences and thoughts, whether they be about programming, composition, or things that can only really be described as \"something else\". If you're seeking learn about the various goings-on in the life of Jacob Stenzel, look no further!",

	"about-intro": "Jacob Stenzel has always bee a maker and a doer with an interest in creating exciting and engaging projects and pieces. He originally comes from a musical background with a heavy interest in composition, contributing his passion creativity through the creation of music and art. He then began to explore computer science and the idea of reaching people through the creation flexible and engaging software. Currently studying at Virginia Tech, Jacob plans to obtain a B.S. in Computer Science while continuing to develop his music composition knowledge and skills. Along the way, he has been a part of several exciting opportunities:",

	"about-l2ork": "Virginia Tech's Laptop Orchestra (L2Ork) is an interdisciplinary project which combines fields such as engineering, programming, music, martial arts, and the visual arts to create an engaging musical performance. Members of this ensemble perform musical pieces with instruments programmed for gesture control devices, such as the Wii Remote.\nJacob Stenzel's role in this ensemble is not only that of a performer, but also that of a composer and instrument builder. His role as an instrument builder has given him the opportunity to program powerful, flexible, and intuitive instruments for performance via gesture control.\nIn the spring of 2015, Jacob was offered the opportunity to create and have performed his piece titled \"The Insomniac\". For this opportunity, Jacob created three new instruments: the \"OscAr\" instrument, which served as the ensemble's first flexible and fully functional Wii Remote synthesizer, the \"Glitcher\", which served as a voice looper and granulator, and a new percussion instrument. The piece was performed at the Spring 2015 DISIS event for an audience of around 100.\nJacob also serves as the Vice President of the Laptop Orchestra Student Organization, whose primary goals are fundraising for equipment and traveling as well as recruiting and advertising.",

	"about-musicomp": "MusiComp is a new club at Virginia Tech to support composers and provide them with useful resources, opportunities, and connections.\nJacob Stenzel serves as the Vice President of this club, where he seeks to create a community of creators. He does this through providing presentations for club meetings on interesting and meaningful topics in music composition, inviting visiting composers to present on their areas of expertise, holding composition composition challenges and contests, getting students works performed, and connecting composers with other clubs and organizations looking for student works or musical accompaniment.",

	"about-fidelity": "In the summer of 2015, Jacob Stenzel had the pleasure of interning at Fidelity Investments at their location in Raleigh, North Carlonina. During his time there, he served as a software development intern on Fidelity's Plan Sponsor WebStation team, where he worked on identifying and fixing a series of defects alongside a longer small enhancement project.\nFor this small enhancement project, Jacob created a new service request form for Qualified Medical Child Support Orders, a document with no existing means of handling at the time. For Jacob, this internship was a great opportunity to see how an individual can affect and modify code in such a large and widely managed corporate project.",

	"about-academic": "Jacob is heavily involved in his studies at Virginia Tech as a computer science major. He currently is a Junior with an expected graduation date of May 2017. Currently he is taking Computer Systems, where he is learning how the Linux operating system manages low level system functions to provide a solid and consistent user experience. He has also taken several data structures and algorithms courses as well as computer music courses to provide him with an outlet for his academic knowledge.\nDuring his time at Virginia Tech, Jacob has been a part of such exciting projects as TileTraveler, where he led a team of three in creating a tile-based movement game for Android; a Protein Cavity Finder project, where he created an algorithm to read in a .pdb file and return a list of locations inside a protein where an atom of a user-defined size could be housed; a GIS lookup system designed to be able to import 200,000+ records across two states, access by location range, and access by name in under 15 seconds; and a MIPS assembler that converts a basic set of MIPS32 instructions, pseudo-instructions, and data directives into an ASCII representation of machine code."
}